import { IAction } from "./IAction";

export const Actions: IAction[] = [
    {
        id: 1,
        name: 'Вальцевать'
    },
    {
        id: 2,
        name: 'Врезаться'
    },
    {
        id: 3,
        name: 'Гальтовать'
    },
    {
        id: 4,
        name: 'Гравировать'
    },
    {
        id: 5,
        name: 'Довести'
    },
    {
        id: 6,
        name: 'Долбить'
    },
    {
        id: 7,
        name: 'Закруглить'
    },
    {
        id: 8,
        name: 'Заточить'
    },
    {
        id: 9,
        name: 'Затылковать'
    },
    {
        id: 10,
        name: 'Зенкеровать'
    },
    {
        id: 13,
        name: 'Нарезать'
    },
    {
        id: 14,
        name: 'Обкатать'
    },
    {
        id: 15,
        name: 'Опилить'
    },
    {
        id: 16,
        name: 'Отрезать'
    },
    {
        id: 17,
        name: 'Подрезать'
    },
    {
        id: 18,
        name: 'Полировать'
    },
    {
        id: 19,
        name: 'Притирать'
    },
    {
        id: 20,
        name: 'Приработать'
    },
    {
        id: 21,
        name: 'Протянуть'
    },
    {
        id: 22,
        name: 'Развернуть'
    },
    {
        id: 25,
        name: 'Рассверлить'
    },
    {
        id: 26,
        name: 'Расточить'
    },
    {
        id: 27,
        name: 'Сверлить'
    },
    {
        id: 28,
        name: 'Строгать'
    },
    {
        id: 29,
        name: 'Суперфинишировать'
    },
    {
        id: 30,
        name: 'Точить'
    },
    {
        id: 31,
        name: 'Хонинговать'
    },
    {
        id: 32,
        name: 'Шевинговать'
    },
    {
        id: 33,
        name: 'Шлифовать'
    },
    {
        id: 34,
        name: 'Целковать'
    },
    {
        id: 35,
        name: 'Центровать'
    },
    {
        id: 36,
        name: 'Фрезировать'
    },
    {
        id: 80,
        name: 'Выверить'
    },
    {
        id: 81,
        name: 'Закрепить'
    },
    {
        id: 82,
        name: 'Настроить'
    },
    {
        id: 83,
        name: 'Переустановить'
    },
    {
        id: 84,
        name: 'Переустановить и закрепить'
    },
    {
        id: 85,
        name: 'Переустановить, выверить и закрепить'
    },
    {
        id: 86,
        name: 'Переместить'
    },
    {
        id: 87,
        name: 'Поджать'
    },
    {
        id: 88,
        name: 'Проверить'
    },
    {
        id: 89,
        name: 'Смазать'
    },
    {
        id: 90,
        name: 'Снять'
    },
    {
        id: 91,
        name: 'Установить'
    },
    {
        id: 92,
        name: 'Установить и выверить'
    },
    {
        id: 93,
        name: 'Установить и закрепить'
    },
    {
        id: 94,
        name: 'Установить, выверить и закрепить'
    }
];